import React, { useState } from "react";

function YourQuestionsFlight() {
  const [details1, setDetails1] = useState(false);
  const [details2, setDetails2] = useState(false);
  const [details3, setDetails3] = useState(false);
  const [details4, setDetails4] = useState(false);
  const [details5, setDetails5] = useState(false);
  const [details6, setDetails6] = useState(false);
  const [details7, setDetails7] = useState(false);
  const [details8, setDetails8] = useState(false);
  const [details9, setDetails9] = useState(false);
  const [details10, setDetails10] = useState(false);

  const detailsHandler1 = () => {
    setDetails1(!details1);
  };

  const detailsHandler2 = () => {
    setDetails2(!details2);
  };

  const detailsHandler3 = () => {
    setDetails3(!details3);
  };

  const detailsHandler4 = () => {
    setDetails4(!details4);
  };

  const detailsHandler5 = () => {
    setDetails5(!details5);
  };

  const detailsHandler6 = () => {
    setDetails6(!details6);
  };

  const detailsHandler7 = () => {
    setDetails7(!details7);
  };
  const detailsHandler8 = () => {
    setDetails8(!details8);
  };
  const detailsHandler9 = () => {
    setDetails9(!details9);
  };
  const detailsHandler10 = () => {
    setDetails10(!details10);
  };
  return (
    <>
      <div className="erfan, justify-center flex mt-[2rem] ">
        <div className="w-[1200px] flex flex-col  ">
          <div className="mb-[19px] ">
            <h2 className="text-[24px] text-[#2b2f33] font-black">
              پرسش های شما
            </h2>
          </div>
          <div className=" border-[1px] rounded-[8px] mb-[3rem]">
            <div>
              {/*  q 1 */}
              <div
                onClick={detailsHandler1}
                className="container_hover py-4 px-4   flex gap-2 border-b-[1px] items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  بلیط پرواز چه کشورها و ایرلاین‌هایی را می‌توانم‌ در سایت
                  علی‌بابا جستجو و خریداری کنم؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details1 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details1 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      بلیط تمام خطوط هوایی دنیا در سایت علی‌بابا موجود است، چه
                      پروازهایی که مبدا یا مقصد آنها ایران است و چه پروازهای
                      داخلی دورترین کشورهای دنیا. پروازهای ایرلاین‌هایی مثل
                      لوفت‌هانزا، امارات، قطرایرویز، ترکیش‌ایر، ایرفرانس،
                      کی‌ال‌ام، آئروفلوت، آلیتالیا، اوکراینی، ایرایژیا، پگاسوس و
                      ده‌ها ایرلاین دیگر در علی‌بابا قابل تهیه هستند. همچنین
                      بلیط پروازهای خارجیِ شرکت های هواپیمایی داخلی مانند ماهان،
                      ایران‌ایر، قشم ایر، آتا و .. نیز روی سایت علی‌بابا به فروش
                      می‌رسد.
                    </p>
                  </div>
                )}
              </div>
              {/*  q 2  */}
              <div
                onClick={detailsHandler2}
                className="container_hover py-4 px-4 flex gap-2 border-b-[1px] items-center justify-between flex-wrap "
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className=" flex-grow-10 font-bold">
                  چطور می توانم در مورد مقررات پرواز یا ویزا مربوط به سفرم
                  اطمینان پیدا کنم؟
                </span>
                <button className=" text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details2 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details2 && (
                  <div className="px-8 ">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      حتما قبل از انتخاب پرواز خود در مورد مقررات پرواز و قوانین
                      مربوط به ویزا تحقیق کنید (مثلا ممکن است مقصد سفر شما نیاز
                      به ویزا نداشته باشد ولی برای توقفی که در مسیر دارد نیاز به
                      ویزای ترانزیت داشته باشید). برای این کار به صفحه قوانین و
                      مقررات پرواز خارجی مراجعه کنید و در صورتی که نیاز به
                      اطلاعات بیشتری داشتید با پشتیبانی علی‌بابا تماس بگیرید.
                      ۰۲۱-۴۳۹۰۰۰۰۰ : شماره تماس
                    </p>
                  </div>
                )}
              </div>
              {/*  q 3  */}
              <div
                onClick={detailsHandler3}
                className="container_hover py-4 px-4 flex gap-2 border-b-[1px] items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  آیا برای خرید بلیط ایرلاین‌های خارجی، نیازی به کردیت‌کارت یا
                  روش‌های پرداخت ارزی خواهم داشت؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details3 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details3 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-4 leading-[2.3]">
                      به هیچ وجه. شما هزینه‌ بلیط را به صورت ریالی و با کارت‌های
                      شتابی که در دست دارید، تنها با داشتن رمز دوم کارت پرداخت
                      می کنید و بلیط شما بلافاصله صادر خواهد شد و قابل استفاده
                      خواهد بود.
                    </p>
                  </div>
                )}
              </div>
              {/* q 4 */}
              <div
                onClick={detailsHandler4}
                className="container_hover py-4 px-4 flex gap-2 border-b-[1px] items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  آیا ساعت، قیمت و دیگر مشخصات پروازها روی سایت علی‌بابا قطعی
                  است؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details4 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details4 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      بله، آنچه پس از جستجوی پرواز مورد نظر خود روی سایت
                      علی‌بابا می‌بینید، برنامه قطعی پروازهای ایرلاین‌هاست که به
                      ریال محاسبه شده است. اگر احیانا تغییری در ساعت یا برنامه‌ی
                      پرواز به وجود بیاید، از طریق پشتیبانی سایت علی‌بابا به
                      اطلاع شما خواهد رسید.
                    </p>
                  </div>
                )}
              </div>
              {/* q 5 */}
              <div
                onClick={detailsHandler5}
                className="container_hover py-4 px-4 flex gap-2 border-b-[1px] items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  آیا پروازهای چارتر خارجی هم روی سایت علی‌بابا عرضه می‌شود؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details5 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details5 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      بله. بلیط کلیه‌ی پروازهای چارتر خارجی که از سوی
                      ایرلاین‌های داخلی یا خارجی برای فروش عرضه می‌شوند را
                      می‌توانید روی سایت علی‌بابا ببینید.
                    </p>
                  </div>
                )}
              </div>
              {/* q 6 */}
              <div
                onClick={detailsHandler6}
                className="container_hover py-4 px-4 flex gap-2 border-b-[1px] items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  چطور می توانم برای سفرم ارزان ترین بلیط ممکن را تهیه کنم؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details6 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details6 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      ارزان بودن بلیط سفر به عوامل مختلفی مرتبط است که برخی از
                      مهم ترین آنها این موارد هستند: در پروازهای سیستمی معمولا
                      هرچه به زمان پرواز نزدیک تر می شویم به دلیل پر شدن کلاس
                      نرخی های ارزان تر، قیمت آن افزایش پیدا می کند. معمولا هرچه
                      زودتر پروازتان را بخرید ارزان تر است. بلیط ایرلاین های
                      مختلف را چک کنید. برای اغلب مسیرها ایرلاین های کم هزینه
                      (Low Cost Airline) وجود دارند که در ازای خدمات و امکانات
                      کمتر، پروازهای ارزان تری به شما پیشنهاد می دهند. در روزهای
                      مختلف سال، فصل و هفته و حتی ساعات متفاوت، قیمت یک پرواز
                      ممکن است تغییرات زیادی داشته باشد. با استفاده از تقویم
                      قیمتی و فیلترهای تعبیه شده جستجو می توانید با چند روز
                      جابجایی پروازهای به مراتب ارزان تری پیدا کنید. علاوه بر
                      این، پروازهای توقف دار و صبح زود هم معمولا پروازهای ارزان
                      تری هستند. بلیط خود را از سایت های معتبر خریداری کنید و
                      قیمت آنها را در ازای خدمتی که می دهند با هم مقایسه کنید.
                      با در نظر گرفتن این موارد می توانید هوشمندانه، بهترین و
                      ارزان ترین پرواز را برای سفر خود تهیه کنید.
                    </p>
                  </div>
                )}
              </div>
              {/* q 7 */}
              <div
                onClick={detailsHandler7}
                className="container_hover py-4 border-b-[1px] px-4 flex gap-2 items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  تقویم قیمتی (Flexible Date) چیست و چه کمکی به من می‌کند؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details7 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details7 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      تقویم قیمتی امکان مقایسه قیمت های روزهای نزدیک به جستجو را
                      به شما می دهد. با کلیلک روی نوار سبز رنگ تقویم قیمتی، قیمت
                      بلیط‌های ۳ روز قبل و ۳ روز بعد از تاریخ مورد نظر شما در
                      جدولی نمایش داده می‌شود و به این ترتیب می‌توانید با تغییر
                      کوچکی در برنامه‌ی سفر خود، هزینه‌ی بلیط را حتی تا نصف کاهش
                      دهید!
                    </p>
                  </div>
                )}
              </div>
              {/* q8 */}
              <div
                onClick={detailsHandler8}
                className="container_hover py-4 border-b-[1px] px-4 flex gap-2 items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  بهترین پروازها (Best Flights) چه پروازهایی هستند؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details8 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details8 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      در هر جستجویی که انجام می دهید، به صورت پیش فرض در ابتدای
                      فهرست با پروازهایی روبرو می شوید که به عنوان بهترین
                      پروازها به شما معرفی می شوند. در الگوریتم گزینش و نمایش
                      این پروازها هر دو فاکتور قیمت و مدت زمان سفر در نظر گرفته
                      شده است.
                    </p>
                  </div>
                )}
              </div>
              {/* q 9 */}
              <div
                onClick={detailsHandler9}
                className="container_hover py-4 border-b-[1px] px-4 flex gap-2 items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  چگونه می توانم بلیط پروازم را کنسل کنم یا تغییر دهم و از شرایط
                  و جریمه آن مطلع شوم؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details9 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details9 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      برای اطلاع دقیق از شرایط و جریمه کنسلی یا تغییر بلیط پرواز
                      مورد نظرتان در هر ساعتی از شبانه روز می توانید با پشتیبانی
                      علی‌بابا تماس بگیرید.
                    </p>
                  </div>
                )}
              </div>
              {/* q 10 */}
              <div
                onClick={detailsHandler10}
                className="container_hover py-4 px-4 flex gap-2 items-center justify-between flex-wrap"
              >
                <span className="text-[#17A2B8] bg-[#E8F9FC] ml-[12px] inline p-[5px] rounded-full">
                  <svg
                    viewBox="0 0 24 24"
                    width="32px"
                    height="32px"
                    fill="currentColor"
                    class="a-accordion__icon"
                  >
                    <path d="M14.442 16.905c0-1.427-.177-2.564-.531-3.411-.322-.77-.931-1.612-1.827-2.525l-.734-.726c-.787-.786-1.298-1.361-1.533-1.726a3.775 3.775 0 0 1-.646-2.126c0-1.005.249-1.776.747-2.312.498-.536 1.23-.804 2.197-.804.93 0 1.676.26 2.241.782.565.522.847 1.233.847 2.133h3.921c-.028-1.905-.68-3.413-1.953-4.524C15.898.556 14.212 0 12.115 0 9.951 0 8.266.548 7.06 1.645 5.853 2.74 5.25 4.275 5.25 6.248c0 1.752.814 3.476 2.442 5.17l1.996 1.954c.709.813 1.072 1.991 1.092 3.533h3.662Zm.273 5.027c0-.642-.199-1.159-.596-1.551-.397-.393-.936-.59-1.616-.59-.69 0-1.233.204-1.63.611-.397.407-.596.917-.596 1.53 0 .584.194 1.075.582 1.472.387.397.936.596 1.644.596.709 0 1.255-.199 1.637-.596.384-.397.575-.888.575-1.472Z"></path>
                  </svg>
                </span>
                <span className="flex-grow-10 font-bold">
                  برای سوار شدن به هواپیما چه زمانی باید در فرودگاه باشم و چه
                  مدارکی مورد نیاز است؟
                </span>
                <button className="text-[#6c7680] ml-1 p-[7px] rounded-full">
                  {details10 ? (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 16.698a.75.75 0 0 0 1.037-1.08l-.069-.066-9.75-8.25a.75.75 0 0 0-.89-.058l-.078.058-9.75 8.25a.75.75 0 0 0 .893 1.202l.075-.056L12 8.858l9.266 7.84Z"></path>
                    </svg>
                  ) : (
                    <svg
                      viewBox="0 0 24 24"
                      width="1em"
                      height="1em"
                      fill="currentColor"
                      class="block"
                    >
                      <path d="M21.266 7.302a.75.75 0 0 1 1.037 1.08l-.069.066-9.75 8.25a.75.75 0 0 1-.89.058l-.078-.058-9.75-8.25a.75.75 0 0 1 .893-1.202l.075.056L12 15.142l9.266-7.84Z"></path>
                    </svg>
                  )}
                </button>
                {details10 && (
                  <div className="px-8">
                    <p className="text-[#6c7680] mr-6 leading-[2.3]">
                      برای اینکه بدون دغدغه سفر خود را آغاز کنید باید حداقل دو
                      ساعت قبل از پرواز در فرودگاه حضور داشته باشید. برای پرواز
                      نیازی به داشتن پرینت بلیط ندارید و تصویر و شماره بلیط به
                      همراه مدارک شناسایی کفایت می کند.
                    </p>
                  </div>
                )}
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}

export default YourQuestionsFlight;
